Revit 2027 API
RebarShapeDefinitionByArc Constructor
Overload List
Name | Description
RebarShapeDefinitionByArc(Document, RebarShapeDefinitionByArcType) |  Create a non-spiral shape definition.
RebarShapeDefinitionByArc(Document, Double, Double, Int32, Int32) |  Create a spiral shape definition.
Top
See Also
Reference
RebarShapeDefinitionByArc Class
Autodesk.Revit.DB.Structure Namespace